Статистика работы механизмов/Конфигурация/DataProcessors/_ЭкспортВЕГАР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_ЭкспортВЕГАР</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкспортСделок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкспортОстатков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкспортСправочника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопСвойства</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновлениеПараметров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкспортБумагУдерживаемыхДоПогашения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_ЭкспортВЕГАР/Forms/ФормаНастроек/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.ДатаВыгрузки) Тогда
		Объект.ДатаВыгрузки = ТекущаяДата();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	КонецЕсли;
	ЭтаФорма.НомерСервера = ЭтаФорма.Параметры.НомерСервера;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ДатаВыгрузки.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	ЭтаФорма.Заголовок = "Экспорт в Егар " + ЭтаФорма.НомерСервера;
	
	ПользовательскаяДатаВыгрузкиПриИзменении();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЭкспортСделокПриИзменении(Элемент)
	Объект.ЭкспортСделок = Истина;
	Объект.ЭкспортОстатков = Ложь;
	Объект.ЭкспортСправочника = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ЭкспортОстатковПриИзменении(Элемент)
	Объект.ЭкспортСделок = Ложь;
	Объект.ЭкспортОстатков = Истина;
	Объект.ЭкспортСправочника = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ЭкспортСправочникаПриИзменении(Элемент)
	Объект.ЭкспортСделок = Ложь;
	Объект.ЭкспортОстатков = Ложь;
	Объект.ЭкспортСправочника = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПользовательскаяДатаВыгрузкиПриИзменении(Элемент = Неопределено)
	Элементы.ДатаВыгрузки.ТолькоПросмотр = Не ПользовательскаяДатаВыгрузки;
	Если Не ПользовательскаяДатаВыгрузки Тогда
		Объект.ДатаВыгрузки = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаУдалитьДанные(Команда)
	КомандаУдалитьДанныеНаСервере(ЭтаФорма.НомерСервера);
КонецПроцедуры

&НаСервере
Процедура КомандаУдалитьДанныеНаСервере(НомерСервера)
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	ОбъектНаСервере.УдалитьДанные(НомерСервера,,);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьДанные(Команда)
	Если Не (Объект.ЭкспортСделок Или Объект.ЭкспортОстатков Или Объект.ЭкспортСправочника) Тогда
		Сообщить("Необходимо указать данные для выгрузки!");
	Иначе
		КомандаЗагрузитьНаСервере(ЭтаФорма.НомерСервера);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КомандаЗагрузитьНаСервере(НомерСервера)
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	ОбъектНаСервере.Загрузить(НомерСервера);
КонецПроцедуры

&НаСервере
Процедура КомандаОбновитьЛимитыНаСервере(Сервер)
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	ОбъектНаСервере.ОбновитьЛимиты(Сервер);
	//ОбновитьЛимиты(Сервер);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьЛимиты(Команда)
	КомандаОбновитьЛимитыНаСервере(ЭтаФорма.НомерСервера);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьБумагиДоПогашения(Команда)
	Объект.ЭкспортБумагУдерживаемыхДоПогашения = Истина;
	КомандаЗагрузитьНаСервере(ЭтаФорма.НомерСервера);
КонецПроцедуры

#КонецОбласти
